import numpy as np
from CombinatoireAlgorithms.TaskMilitaryBases import GetInfoAboutBastMilitaryBase

#region ValidTests
print("ТЕСТИРОВАНИЕ АЛГОРИТМА:\n")

print("Cлучай для примера из пособия, когда все ci равны 1")
size = 9
A = np.array([
    [1, 1, 0, 1, 0, 0, 0, 0, 0],
    [1, 1, 1, 0, 1, 0, 0, 0, 0],
    [0, 1, 1, 0, 0, 1, 0, 0, 0],
    [1, 0, 0, 1, 1, 0, 1, 0, 0],
    [0, 1, 0, 1, 1, 1, 0, 1, 0],
    [0, 0, 1, 0, 1, 1, 0, 0, 1],
    [0, 0, 0, 1, 0, 0, 1, 1, 0],
    [0, 0, 0, 0, 1, 0, 1, 1, 1],
    [0, 0, 0, 0, 0, 1, 0, 1, 1]
])
losses = [1, 1, 1, 1, 1, 1, 1, 1, 1]
GetInfoAboutBastMilitaryBase(size, A, losses)

print("\nСлучай для примера из пособия, когда 5 баз выгоднее чем 3")
size = 9
A = np.array([
    [1, 1, 0, 1, 0, 0, 0, 0, 0],
    [1, 1, 1, 0, 1, 0, 0, 0, 0],
    [0, 1, 1, 0, 0, 1, 0, 0, 0],
    [1, 0, 0, 1, 1, 0, 1, 0, 0],
    [0, 1, 0, 1, 1, 1, 0, 1, 0],
    [0, 0, 1, 0, 1, 1, 0, 0, 1],
    [0, 0, 0, 1, 0, 0, 1, 1, 0],
    [0, 0, 0, 0, 1, 0, 1, 1, 1],
    [0, 0, 0, 0, 0, 1, 0, 1, 1]
])
losses = [0.1, 1, 0.1, 1, 0.1, 1, 0.1, 1, 0.1]
GetInfoAboutBastMilitaryBase(size, A, losses)
# endregion

#region InvalidTests
print("\nТЕСТИРОВАНИЕ РАБОТОСПОСОБНОСТИ:")

print("\nCлучай, когда n <= 0")
size = 0
A = np.array([
    [1, 1, 0, 1, 0, 0, 0, 0, 0],
    [1, 1, 1, 0, 1, 0, 0, 0, 0],
    [0, 1, 1, 0, 0, 1, 0, 0, 0],
    [1, 0, 0, 1, 1, 0, 1, 0, 0],
    [0, 1, 0, 1, 1, 1, 0, 1, 0],
    [0, 0, 1, 0, 1, 1, 0, 0, 1],
    [0, 0, 0, 1, 0, 0, 1, 1, 0],
    [0, 0, 0, 0, 1, 0, 1, 1, 1],
    [0, 0, 0, 0, 0, 1, 0, 1, 1]
])
losses = [1, 1, 1, 1, 1, 1, 1, 1, 1]
GetInfoAboutBastMilitaryBase(size, A, losses)

print("\nCлучай, когда n не совпадает с колличеством векторов матрицы A")
size = 3
A = np.array([
    [1, 1, 0, 1, 0, 0, 0, 0, 0],
    [1, 1, 1, 0, 1, 0, 0, 0, 0],
    [0, 1, 1, 0, 0, 1, 0, 0, 0],
    [1, 0, 0, 1, 1, 0, 1, 0, 0],
    [0, 1, 0, 1, 1, 1, 0, 1, 0],
    [0, 0, 1, 0, 1, 1, 0, 0, 1],
    [0, 0, 0, 1, 0, 0, 1, 1, 0],
    [0, 0, 0, 0, 1, 0, 1, 1, 1],
    [0, 0, 0, 0, 0, 1, 0, 1, 1]
])
losses = [1, 1, 1, 1, 1, 1, 1, 1, 1]
GetInfoAboutBastMilitaryBase(size, A, losses)

print("\nCлучай, когда n не совпадает с размерностью какого-либо вектора матрицы A")
error = False
size = 9
try:
    A = np.array([
        [1, 1, 0, 1, 0, 0, 0, 0, 0],
        [1, 1, 1, 0, 1, 0, 0, 0, 0],
        [0, 1, 1, 0, 0, 1, 0, 0, 0],
        [1, 0, 0, 1, 1, 0, 1],
        [0, 1, 0, 1, 1, 1, 0, 1, 0],
        [0, 0, 1, 0, 1, 1, 0, 0, 1],
        [0, 0, 0, 1, 0, 0, 1, 1, 0],
        [0, 0, 0, 0, 1, 0, 1, 1, 1],
        [0, 0, 0, 0, 0, 1, 0, 1, 1]
    ])
except:
    print(f">> Ошибка! Код: 201: Не удалось создать матрицу!")
    error = True
if not error:
    losses = [1, 1, 1, 1, 1, 1, 1, 1, 1]
    GetInfoAboutBastMilitaryBase(size, A, losses)

print("\nCлучай, когда размерность ci не совпадает с размерностью n")
size = 9
A = np.array([
    [1, 1, 0, 1, 0, 0, 0, 0, 0],
    [1, 1, 1, 0, 1, 0, 0, 0, 0],
    [0, 1, 1, 0, 0, 1, 0, 0, 0],
    [1, 0, 0, 1, 1, 0, 1, 0, 0],
    [0, 1, 0, 1, 1, 1, 0, 1, 0],
    [0, 0, 1, 0, 1, 1, 0, 0, 1],
    [0, 0, 0, 1, 0, 0, 1, 1, 0],
    [0, 0, 0, 0, 1, 0, 1, 1, 1],
    [0, 0, 0, 0, 0, 1, 0, 1, 1]
])
losses = [1, 1, 1, 1, 1, 1, 1] #размерность 7
GetInfoAboutBastMilitaryBase(size, A, losses)

print("\nCлучай, когда размерность n не целое")
size = 2.5
A = np.array([
    [1, 1, 0, 1, 0, 0, 0, 0, 0],
    [1, 1, 1, 0, 1, 0, 0, 0, 0],
    [0, 1, 1, 0, 0, 1, 0, 0, 0],
    [1, 0, 0, 1, 1, 0, 1, 0, 0],
    [0, 1, 0, 1, 1, 1, 0, 1, 0],
    [0, 0, 1, 0, 1, 1, 0, 0, 1],
    [0, 0, 0, 1, 0, 0, 1, 1, 0],
    [0, 0, 0, 0, 1, 0, 1, 1, 1],
    [0, 0, 0, 0, 0, 1, 0, 1, 1]
])
losses = [1, 1, 1, 1, 1, 1, 1] #размерность 7
GetInfoAboutBastMilitaryBase(size, A, losses)

#endregion

AT = np.array([
    [1, 1, 0, 0, 0, 0, 0, 0, 0],
    [1, 1, 1, 0, 0, 0, 0, 0, 0],
    [0, 1, 1, 1, 0, 0, 0, 0, 0],
    [0, 0, 1, 1, 1, 0, 1, 0, 0],
    [0, 0, 0, 1, 1, 1, 0, 0, 0],
    [0, 0, 0, 0, 1, 1, 0, 0, 0],
    [0, 0, 0, 1, 0, 0, 1, 1, 0],
    [0, 0, 0, 0, 0, 0, 1, 1, 1],
    [0, 0, 0, 0, 0, 0, 0, 1, 1]
])
